Repository: dsent/dungeon
Catalog: src/l10n/*/LC_MESSAGES/dungeon.po
Languages: ru_ru

source: Nameless
ru_ru: Безымянный

source: You're standing in some nondescript room.
ru_ru: Ты оказался в совершенно ничем не примечательной комнате. В ней нет дверей. Нет окон. Совершенно непонятно, что делать.

source: How did you do that, cheater?
ru_ru: Как ты это сделал, читер?!

source: (?P<scene>exit|quit)(\s+game)?
ru_ru: (?:я)? (?:\s*\b (?:буду|хочу|собира(?:юсь|лся)|готов|решил) )? (\s*\b (?:вы(?:хо(?:д|жу)|й(?:ти|ду))|поки(?:ну(?:ть)?|даю)|заверш(?:ить|аю)) ) (?:\s*\b(?:из\s+)?игр[уы])? [.!]?

source: Goodbye!
ru_ru: До новых встреч!

source: I don't understand that.
ru_ru: Ничего не понял. На всякий случай будем считать, что ты проиграл.

source: Very Small Dungeon
ru_ru: Очень Маленькое и Чрезвычайно Скучное Подземное Королевство

source: Welcome, player {} to the map {}!
ru_ru: Добро пожаловать, о благородный путешественник {}! Судьба забросила тебя в священные земли под названием {}.

source: Tell me your name:
ru_ru: Как тебя называть, о бесстрашный искатель приключений?

source: Press Enter to exit.
ru_ru: Нажми Enter для выхода.

source: You haven't really thought that was an option, have you?
ru_ru: Ты же не думал, что это прокатит?

source: That would be stupid, don't you think?
ru_ru: Тебе не кажется, что это как-то тупо?

source: No way. Just no freaking way.
ru_ru: Нет. Ни за что.

source: The thought of doing that suddenly gave you chills. No, you won't do that.
ru_ru: Одна только мысль об этом внезапно вызвала мурашки по коже. Пожалуй, ты не будешь этого делать.

source: That's simply not possible.
ru_ru: Это просто невозможно.

source: It's no use doing that. You should have tried something else.
ru_ru: Ну нет, это бесполезно. Надо попробовать что-то другое.

source: enthusiastic
ru_ru: полон энтузиазма

source: excited
ru_ru: воодушевлён

source: active
ru_ru: бодр

source: calm
ru_ru: спокоен

source: bored
ru_ru: скучаешь

source: extremely bored
ru_ru: помираешь от скуки

source: fed up with your life
ru_ru: сыт по горло такой жизнью

source: You were bored to death.
ru_ru: Терпеть это больше невозможно. Жизнь лишена всякого смысла! В сравнении с бесплодными метаниями по сырым поздемельям, даже смерть кажется привлекательным вариантом. Экзистенциальная тоска заполняет душу до предела и... Будто что-то обрывается в груди. Твоё тело безжизненно оседает на каменные плиты. Ты умудрился умереть со скуки! Молодец, нечего сказать.

source: Not advancing is boring. You're now {}.
ru_ru: /Топтаться на месте ужасно скучно. /Ты {}

source: That was refreshing. You're now {}.
ru_ru: /Хоть что-то новое! Это освежает. /Теперь ты {}

source: You're at the entrance.
ru_ru: Ты стоишь у входа в подземелье. Пара тусклых факелов на стенах освещает единственную дверь прямо перед тобой.

source: You're still at the entrance.
ru_ru: Ты всё ещё стоишь у входа в подземелье. Дверь всё ещё на месте. Вообще-то, здесь холодно.

source: (?P<entrance>open door|go through)
ru_ru: # Debugged (?:я)? (?:\s*\b (?:буду|хочу|собира(?:юсь|лся)|готов|решил) )? (\s*\b (?:откр(?:ыть|ою)| (?:пр?|в)? (?: (?:ой|и) (д?([её]м|у|ти)) ) ) )? (?:\s*\bчерез)? (?(1) # if action is specified, (?:\s*\b(?:дверь|впер[её]д))?| # door is optional, (?:\s*\b(?:дверь|впер[её]д)) # otherwise required ) [.!]?

source: The door opens. You leap into the doorway!
ru_ru: Дверь открылась. Ты аж прыгаешь в неё, так тебе не терпится наконец начать своё приключение! Глухой звук захлопывающейся двери чуть не заставил тебя подпрыгнуть. Ты понимаешь, что пути назад нет.

source: You're in a dark room. There are three doors: left, right and center.
ru_ru: Ты в подземелье, в слабоосвещённом помещении. Перед тобой три двери. На двери слева многочисленные следы огромных когтей. И несколько вмятин, явно оставленных крупным предметом с обратной стороны. Дверь справа сверху донизу покрыта зловещим орнаментом. Если вглядеться в рисунок, голова начинает кружиться, в ушах стучит кровь и будто бы слышны голоса, всё громче и страшнее. Ты поспешно отворачиваешься, голоса стихают. Дверь в центре совершенно обычная, хотя очень прочная на вид. Возможно, огнеупорная.

source: You're still in the dark room with three doors.
ru_ru: Ты всё ещё в плохо освещённой комнате с тремя дверями. Слева — дверь со следами когтей, по центру — простая массивная, справа — покрытая орнаментами.

source: (?P<first>left|first)(\s+door)?
ru_ru: # Debugged (?:я)? (?:\s*\b (?:буду|хочу|собира(?:юсь|лся)|готов|решил) )? (\s*\b (?:откр(?:ыть|ою)| (?:пр?|в)? (?: (?:ой|и) (д?([её]м|у|ти)) ) ) )? (?:\s*\b(через|в))? (?:\s*\bдверь)? (?:\s*\b(?:слева|налево|лев(?:ая|ую)|перв(?:ая|ую)|1(?:-?а?я)?)) (?:\s*\bдверь)? [.!]?

source: (?P<first>right|second)(\s+door)?
ru_ru: # Debugged (?:я)? (?:\s*\b (?:буду|хочу|собира(?:юсь|лся)|готов|решил) )? (\s*\b (?:откр(?:ыть|ою)| (?:пр?|в)? (?: (?:ой|и) (д?([её]м|у|ти)) ) ) )? (?:\s*\b(через|в))? (?:\s*\bдверь)? (?:\s*\b(?:справа|направо|прав(?:ая|ую)|втор(?:ая|ую)|2(?:-?а?я)?)) (?:\s*\bдверь)? [.!]?

source: (?P<first>center|central|third)(\s+door)?
ru_ru: # Debugged (?:я)? (?:\s*\b (?:буду|хочу|собира(?:юсь|лся)|готов|решил) )? (\s*\b (?:откр(?:ыть|ою)| (?:пр?|в)? (?: (?:ой|и) (д?([её]м|у|ти)) ) ) )? (?:\s*\b(через|в))? (?:\s*\bдверь)? (?:\s*\b(?:прямо|по\s+центру|центр(?:альн(?:ая|ую))?|треть[яю]|средн(?:яя|юю)|3(?:-?я?я)?)) (?:\s*\bдверь)? [.!]?

source: Excellent choice! Or not.
ru_ru: Отличный выбор! Или нет.

source: Fantastic choice! No, wait, it isn't.
ru_ru: Гениальное решение! Ох, нет, подожди-ка...

source: You were asking for trouble.
ru_ru: Если подумать, ты напрашивался.

source: Bears sits a few feet away from the door.
ru_ru: Медведь сидит немного в стороне от двери, не обращает на тебя внимания. Возможно, сейчас самое время пройти через дверь. Или попробовать ещё подвинуть медведя. Или всё-таки попытаться отобрать мёд? Выглядит очень вкусно!

source: Bears sits in front of a door.
ru_ru: Медведь не выглядит агрессивным, но сидит прямо перед дверью. Можно попробовать его как-то отодвинуть. Или протиснуться мимо него в дверь. Или попытаться забрать себе мёд.

source: There is a fat bear here. He has a pot of honey. There is a door right before you.
ru_ru: В помещении только одна дверь помимо той, через которую ты вошёл, и она прямо перед тобой. Ещё здесь сидит медведь. С большим горшком мёда.

source: The bear is still here.
ru_ru: Ты всё ещё здесь. Дверь прямо перед тобой, медведь, мёд.

source: (?P<bear>take\s+)?(honey|pot)
ru_ru: # Debugged (?:я)? (?:\s*\b (?:буду|хочу|собира(?:юсь|лся)|готов|решил) )? (\s*\b(?:за|ото?)?б?(?:еру|ираю|ра|ня)(?:л|ть)?)? # Action (?:\s*\b(?:у\s+медведя|медвежий))? (?(1) # if action is specified, (?:\s*\b(?:м[её]д|горшок))?| # door is optional, (?:\s*\b(?:м[её]д|горшок)) # otherwise required ) (?:\s*\b(?:с\s+)?м[её]д(?:ом|а)?)? (?:\s*\b(?:у\s+)?медведя)? [.!]?

source: (?P<bear>taunt|scream)(\s+at)?(\s+bear)?
ru_ru: # Debugged (?:я)? (?:\s*\b (?:буду|хочу|собира(?:юсь|лся)|готов|решил) )? (\s*\b ( (?:на|ис)?пуга(?:ю|л|ть)| (?:за|на)?крич(?:у|ал|ать)| (?:за|с)?п(?:е(?:л|ть)|ою)| (?:у?)баюка(?:л|ть|ю)| (?:по)?дразн(?:ить|ил|ю) ) ) # Action (?:\s*\bмедвед[яю])? (?:\s*\bколыбельн(?:ая|ую))? (?:\s*\bпесе?н(?:ю|ку))? [.!]?

source: (?P<bear>open door|go through)
ru_ru: # Debugged (?:я)? (?:\s*\b (?:буду|хочу|собира(?:юсь|лся)|готов|решил) )? (\s*\b (?:откр(?:ыть|ою)| (?:пр?|в)? (?: (?:ой|и) (д?([её]м|у|ти)) ) ) )? (?:\s*\bчерез)? (?(1) # if action is specified, (?:\s*\b(?:дверь|впер[её]д))?| # door is optional, (?:\s*\b(?:дверь|впер[её]д)) # otherwise required ) [.!]?

source: The bear looks at you then slaps your face off.
ru_ru: Мудрое решение! Медведь посмотрел на тебя внимательно и отхерачил лапой пол-лица. Ты умер.

source: The bear gets pissed off and chews your leg off.
ru_ru: Великолепно! Медведь взбесился и отгрыз тебе ногу. А ты возьми да помри.

source: The bear moves away from the door.
ru_ru: Всё прошло как по нотам! Медведь недовольно забурчал и отошёл от двери. Похоже, путь открыт. Но вот безопасен ли?..

source: The bear didn't even look at you as you passed it.
ru_ru: Все опасения были беспочвенны. Медведь даже не посмотрел в твою сторону, когда ты прошёл мимо него.

source: The bear eats your belly.
ru_ru: Отлично! Ты попытался протиснуться к двери. Медведю это не понравилось, и он лишил тебя половины кишечника и изрядной части печени одним укусом. Ты быстро истёк кровью и умер.

source: You see Cthulhu. You can try to flee or eat your head.
ru_ru: Перед тобой — Владыка Ужаса Ктулху собственной персоной. Он, она, оно... В общем, поднимает на тебя свой взор и безумие охватывает тебя. Можешь попробовать убежать, спасая свою жизнь. Или принять свою судьбу и съесть собственную голову.

source: (?P<cthulhu>flee)
ru_ru: # Debugged (?:я)? (?:\s*\b (?:буду|хочу|собира(?:юсь|лся)|готов|решил) )? (\s*\b[ус]?бе[жг](?:ать|у|аю)) # Action (?:\s*\b(?:от\s+)ктулху)? (?:\s*\b(?:из\s+)(?:зала|комнаты|помещения|чергог(?:а|ов)))? [.!]?

source: (?P<cthulhu>(?:eat)?(?:\s*\bmy)?(?:\s*\bhead)?(?<!^))
ru_ru: # Debugged (?:я)? (?:\s*\b (?:буду|хочу|собира(?:юсь|лся)|готов|решил) )? (\s*\b (?:(?:съ)?е(?:м|л|сть)| (?:со)?жр(?:у|ал|ать)) )? (?:\s*свою)? (?:\s*собственную)? (?(1) # if action is specified, (?:\s*\bголов(?:у|а))?| # head is optional, (?:\s*\bголов(?:у|а)) # otherwise required ) [.!]?

source: (?P<cthulhu>.*)
ru_ru: # Debugged .*

source: Cthulhu didn't follow you. You got away.
ru_ru: Владыка Ужаса Ктулху вечен и не гоняется за жалкими червями вроде тебя. Тебе удалось сбежать. Безумие отступило. Ктулху, конечно, скоро увидит твоё разлагающееся тело, ведь для него срок человеческой жизни — всего лишь миг.

source: You smiled as you ate your head. That was yummy!
ru_ru: Идиотски улыбаясь, ты сожрал собственную голову. Вкусняшка!

source: You didn't feel like doing it and ate your head instead. It was yummy!
ru_ru: Почему-то, делать так совершенно не хотелось и ты решил вместо этого сожрать свою голову. Что и сделал, идиотски улыбаясь. Вкусняшка!

source: This room is full of gold. You should take some.
ru_ru: Комната полна золота. Можешь взять сколько хочешь.

source: (?P<amount>(?:\\d+[.,]?\\d*|none|nothing|zero))
ru_ru: # Debugged (?:я)? (?:\s*\b (?:буду|хочу|собира(?:юсь|лся)|готов|решил) )? (?:\s*\b (?:взя(?:ть|л)|возьму|забра(?:ть|л)|заберу|укра(?:сть|ду)|с?тыр(?:и(?:ть|л)|ю)|унес(?:ти|у)) )? (?:\s*\bс\s+собой)? (?:\s*\b (?P<amount> (?:\d+[.,]?\d*|нисколько|ничего|ноль) ) ) (?:\s*\bзолот(?:ых|ые|а))? (?:\s*\b(?:монет(?:ы|ки|ок)?|предмет(?:ов|ы)?))? [.!]?

source: none
ru_ru: нисколько

source: nothing
ru_ru: ничего

source: zero
ru_ru: ноль

source: Nice, you're not greedy!
ru_ru: Ты очень скромен! За это тебе позволено покинуть подземелье с наградой. Ура, победа!

source: You're greedy bastard!
ru_ru: Ты жадный ублюдок! Явился Бог Жадности и отгрыз твою жадную задницу.

source: You can't even enter a number? You die of dumbness.
ru_ru: Ты не смог как следует ввести число и умер от тупости.

source: The room is filled with lava.
ru_ru: В помещении отсутствует пол. Внизу плещется раскалённая лава. Пару секунд ты балансируешь на пороге, пытаясь удержаться от падения. Потом падаешь.

source: You fall to the bottom and die.
ru_ru: Твои жалкие попытки удержаться от падения ни к чему не привели. Ты падаешь на самое дно. Первые несколько секунд ты даже пытался кричать, хотя это непросто с обожженными голосовыми связками. Когда в лёгких закончился воздух, стало ещё сложнее. Хорошая новость: буквально через несколько секунд тебя это совершенно перестало беспокоить. Если посмотреть объективно, довольно неплохая смерть. По стандартам этой игры — практически идеальная. В следующий раз попробуй добраться до Залы Ктулху, для сравнения.

source: The Underground Realm of the Dread Lord Cthulhu
ru_ru: Подземный Чертог Владыки Ужаса Ктулху
